{
  "role": "machine learning engineer",
  "descriptions": [
    "Experience: 4–6 years\nKey Responsibilities:\nBuild machine learning models to predict asset health, process anomalies, and optimize operations. Work on sensor data pre-processing, model training, and inference deployment.\nCollaborate with simulation engineers for closed-loop systems.\nSkills Required:\nExperience in time-series modeling, regression/classification, and anomaly detection.\nFamiliarity with Python, scikit-learn, TensorFlow/PyTorch.\nExperience with ML Ops on Azure ML, Databricks, or similar.\nUnderstanding of manufacturing KPIs (e.g., OEE, MTBF, cycle time).\nJob Types: Full-time, Permanent\nPay: ₹700,000.00 - ₹1,500,000.00 per year\nBenefits:\nHealth insurance\nSchedule:\nDay shift\nSupplemental Pay:\nCommission pay\nWork Location: Remote\nApplication Deadline: 30/06/2025",
    "**Job Summary:**\nWe are looking for an experienced **Machine Learning Engineer** with deep hands-on expertise in **JAX** and a strong understanding of **TensorFlow**. In this role, you will lead the migration of TensorFlow models and training pipelines to JAX while ensuring model fidelity and performance remain consistent. You will also design tools and frameworks to support seamless future framework transitions.\nThis is a high-impact engineering role focused on low-level model internals, performance benchmarking, and framework interoperability.\nRoles and Responsibilities\n* Translating production-grade machine learning models from TensorFlow to JAX\n* Designing and executing robust evaluation pipelines to ensure model fidelity post-migration\n* Developing tools and scripts to automate framework translation and validation\n* Collaborating with research and product teams to align performance metrics and validation needs\n* Conducting performance benchmarking and profiling to ensure optimal model efficiency\n* Building reproducible ML workflows and ensuring version-controlled development\nRequirements:\n* Proven 4+experience with JAX and NumPy in real-world ML projects\n* Strong understanding of TensorFlow, including internals and model structure\n* Experience with migrating models between frameworks and ensuring parity\n* Solid grasp of ML training workflows, loop mechanics, and evaluation metrics\n* Strong Python programming skills and clean, modular code practices\n* Familiarity with ML experiment tracking and reproducibility tools (e.g., MLFlow, Weights & Biases)\nJob Type: Full-time\nPay: ₹1,000,000.00 - ₹1,500,000.00 per year\nSchedule:\nDay shift\nWork Location: Remote",
    "DataAnnotation is committed to creating quality AI. Join our team to help train AI chatbots while gaining the flexibility of remote work and choosing your own schedule.\nWe are looking for a Bilingual Content Editor and AI Trainer to join our team and teach AI chatbots. You will have conversations in both Hindi and English with chatbots in order to measure their progress, as well as write novel conversations in order to teach them what to say.\nBenefits:\nThis is a full-time or part-time REMOTE position\nYou’ll be able to choose which projects you want to work on\nYou can work on your own schedule\nProjects are paid hourly, starting at $22+ USD per hour, with bonuses for high-quality and high-volume work\nResponsibilities (both in Hindi and English):\nCome up with diverse conversations over a range of topics\nWrite high-quality answers when given specific prompts\nCompare the performance of different AI models\nResearch and fact-check AI responses\nQualifications:\nFluent in Hindi + English\nA bachelor's degree (completed or in progress)\nExcellent writing and grammar skills\nStrong research and fact-checking skills to ensure accuracy and originality\nNote: Payment is made via PayPal. We will never ask for any money from you.\n#INDHIAR\nJob Type: Freelance\nPay: From ₹1,902.09 per hour\nWork Location: On the road",
    "Job Title: Machine Learning Engineer\nJob Type: Contract (2 Months)\nLocation: Remote (Preferred: India, Pakistan, Nigeria, Kenya, Egypt, Ghana, Bangladesh, Turkey, Mexico)\nWork Hours: Minimum 20 hours per week, with at least 4 hours/day overlapping with PST\nEmployment Type: Contractor (No medical benefits or paid leave)\nJob Overview:\nWe are seeking an experienced Machine Learning Engineer with strong expertise in JAX and solid knowledge of TensorFlow. You will lead the migration of TensorFlow models and training pipelines to JAX, ensuring model accuracy and optimal performance. This role requires deep involvement in model internals, benchmarking, and cross-framework compatibility.\nKey Responsibilities:\nMigrate production-grade ML models from TensorFlow to JAX\nDesign and execute evaluation pipelines to ensure model fidelity\nDevelop tools and scripts to automate framework translation and validation\nCollaborate with research and product teams to align performance and validation metrics\nConduct performance benchmarking and profiling to optimize efficiency\nBuild reproducible ML workflows with strong version control\nRequired Skills:\nProven hands-on experience with JAX and NumPy in real-world ML projects\nStrong knowledge of TensorFlow internals and model structures\nExperience migrating models across frameworks with parity\nStrong understanding of ML training workflows and evaluation metrics\nProficient in Python with clean, modular coding practices\nFamiliarity with ML experiment tracking tools (MLFlow, Weights & Biases)\nPreferred Skills (Bonus):\nExperience with PyTorch, Flax, or other ML libraries\nBackground in ML research or scientific computing\nExperience with production model monitoring and governance\nAdditional Details:\nStart Date: Expected next week\nInterview Process: Two rounds (60 min technical + 30 min technical & cultural fit)\nPerks: 100% remote work, opportunity to work on advanced AI and LLM projects\n.",
    "Desired:\n● Google Cloud Platform experience\n● Experience working with ML on vertex AI pipelines\n● Strong CICD knowledge\n● Enthusiastic and positive leader with a self-directed and self-motivated attitude\n● Comfortable with ambiguity ● Excellent communication and influencing skills\n● Excellent collaboration skills\n● Excellent analytical and problem solving skills with the ability to think quick and offer alternatives\n● Able to work in a fast-paced environment\n● Effective time management to prioritise workload\n● Ability to work on multiple, concurrent tasks\n● Lead continuous improvement\n● Constantly challenge the status quo & be open to new technologies & ideas\n● Ability to see the big picture\n● Strong commercial experience\n● Display passion for & responsibility to customer and partners\nMandate Skill:\nVertex AI, Python, Machine Learning, Gen AI and GCP\nJob Type: Full-time\nSchedule:\nRotational shift\nWork Location: Remote\nApplication Deadline: 15/07/2025\nExpected Start Date: 15/07/2025",
    "DataAnnotation is committed to creating quality AI. Join our team to help train AI chatbots while gaining the flexibility of remote work and choosing your own schedule.\nWe are looking for a bilingual professional to join our team and teach AI chatbots. You will have conversations in both Hindi and English with chatbots in order to measure their progress, as well as write novel conversations in order to teach them what to say.\nBenefits:\nThis is a full-time or part-time REMOTE position\nYou’ll be able to choose which projects you want to work on\nYou can work on your own schedule\nProjects are paid hourly, starting at $22+ USD per hour, with bonuses for high-quality and high-volume work\nResponsibilities (both in Hindi and English):\nCome up with diverse conversations over a range of topics\nWrite high-quality answers when given specific prompts\nCompare the performance of different AI models\nResearch and fact-check AI responses\nQualifications:\nFluent in Hindi + English\nA bachelor's degree (completed or in progress)\nExcellent writing and grammar skills\nStrong research and fact-checking skills to ensure accuracy and originality\nNote: Payment is made via PayPal. We will never ask for any money from you.\n#INDHIAR\nJob Type: Freelance\nPay: From ₹1,902.09 per hour\nWork Location: On the road",
    "Perennial Systems is looking for a skilled Machine Learning Engineer with hands-on experience deploying models on Google Cloud Platform (GCP) using Vertex AI. This role involves enabling real-time and batch model inferencing based on specific business requirements, with a strong focus on production-grade ML deployments.\nExperience: 3 to 4 years\nKey Responsibilities:\nDeploy machine learning models on GCP using Vertex AI.\nDesign and implement real-time and batch inference pipelines.\nMonitor model performance, detect drift, and manage lifecycle.\nEnsure adherence to model governance best practices and support ML-Ops workflows.\nCollaborate with cross-functional teams to support Credit Risk, Marketing, and Customer Service use cases, especially within the retail banking domain.\nDevelop scalable and maintainable code in Python and SQL.\nWork with diverse datasets, perform feature engineering, and build, train, and fine-tune advanced predictive models.\nContribute to model deployment in the lending space.\nRequired Skills & Experience:\nStrong expertise in Python and SQL.\nProficient with ML libraries and frameworks such as scikit-learn, pandas, NumPy, spaCy, CatBoost, etc.\nIn-depth knowledge of GCP Vertex AI and ML pipeline orchestration.\nExperience with ML-Ops and model governance.\nExposure to use cases in retail banking—Credit Risk, Marketing, and Customer Service.\nExperience working with structured and unstructured data.\nNice to Have:\n* Prior experience deploying models in the lending domain.\n* Understanding of regulatory considerations in financial services.\nJob Type: Full-time\nPay: ₹460,731.74 - ₹1,769,946.09 per year\nBenefits:\nHealth insurance\nLeave encashment\nProvident Fund\nWork from home\nSchedule:\nDay shift\nApplication Question(s):\nWhat is your last working day?\nWork Location: Remote\nApplication Deadline: 22/06/2025\nExpected Start Date: 28/06/2025",
    "● Proven experience in training, evaluating and deploying machine learning models\n● Solid understanding of data science and machine learning concepts\n● Experience with some machine learning / data engineering machine learning tech in Python (such as numpy, pytorch, pandas/polars, airflow, etc)\n● Experience developing data products using large language model, prompt engineering, model evaluation.\n● Experience with web services and programming (such as Python, docker, databases etc.)\n● Understanding of some of the following: FastAPI, PostgreSQL, Celery, Docker, AWS, Modal, git, continuous integration.\nJob Types: Full-time, Permanent\nPay: ₹2,500,000.00 - ₹3,500,000.00 per year\nBenefits:\nHealth insurance\nPaid sick time\nProvident Fund\nSchedule:\nMonday to Friday\nUK shift\nWork Location: In person",
    "Job Title: Machine Learning Engineer\nJob Type: Full-time\nLocation: Remote (10am to 7pm, Mon-Fri)\nTeam: Data & ML Engineering\nExperience Required: 8+ years (Startup experience is a plus)\nAbout the Company\nWe are a fast-growing, AI-first fintech startup focused on transforming how enterprise finance teams make decisions.\nOur platform is a subscription-based SaaS solution offering AI-powered financial intelligence tools tailored for enterprise-level teams. We aim to improve decision-making by automating data workflows and delivering real-time, predictive insights.\nRaised $4M in pre-seed funding (January 2023)\nLean team of 15–20 members\nActively used by businesses for forecasting HR and financial planning\nRole Overview\nWe are hiring a Machine Learning Engineer to join our Data & ML Engineering team. This role will play a key part in building and scaling the models and systems that power our intelligent financial planning products.\nResponsibilities\nDevelop and optimize machine learning models (e.g., regression, time-series forecasting)\nBuild scalable training and inference pipelines using Ray, Airflow, and Docker\nEvaluate and tune models using MLflow, Ray Tune, and scikit-learn\nDesign and deploy features powered by large language models (LLMs)\nWork with product managers to convert business requirements into experiments and production-ready solutions\nCollaborate with software and DevOps teams for seamless ML integrations\nBasic Requirements\nStrong problem-solving and analytical skills\nExperience in supervised learning and time-series modeling\nProficiency in Python and SQL for writing scalable code\nHands-on experience deploying ML models via automated pipelines\nFamiliarity with cloud-native tools (e.g., S3, Docker) and asynchronous workflows\nStrong communication and teamwork skills\nAbility to independently lead projects from concept to deployment\nPreferred Qualifications\nExperience with large language models (LLMs), NLP, or vector stores\nKnowledge of MLOps best practices and experience working with production ML systems\nContributions to open-source ML or data projects\nTechnology Stack\nLanguages: Python, SQL\nFrameworks & Tools: scikit-learn, Prophet, pyts, MLflow, Ray, Ray Tune, Jupyter\nInfrastructure: Docker, Airflow, S3, asyncio, Pydantic\nJob Type: Full-time\nPay: ₹3,000,000.00 - ₹3,200,000.00 per year\nBenefits:\nHealth insurance\nProvident Fund\nWork from home\nSchedule:\nDay shift\nEvening shift\nMonday to Friday\nSupplemental Pay:\nPerformance bonus\nYearly bonus\nExperience:\nMachine learning: 8 years (Required)\nAWS: 5 years (Required)\nWork Location: Remote",
    "2–4 years of experience in Machine Learning/NLP, with a focus on GenAI.\nHands-on experience with LLMs like GPT-4, Claude, LLaMA, or Mistral.\nProficiency in Python and ML frameworks such as PyTorch, TensorFlow, or Hugging Face Transformers.\nUnderstanding of vector databases, prompt engineering, and RAG systems.\nDeployment experience using FastAPI, Docker, and cloud platforms (AWS, GCP, or Azure).\nBuild scalable AI agents, intelligent chatbots, copilots, and automation tools.\nExperience with tools like LangChain, OpenAI Assistants API, or Copilot extensions.\nA passion for reading AI/LLM research papers and applying insights practically.\nStay updated with the latest trends and research in the GenAI and LLM space.\nKnowledge of RAG systems, vector databases, and prompt engineering.\nDevelop prompt engineering frameworks, RAG pipelines, and vector-based retrieval systems.\nJob Type: Part-time\nPay: ₹20,000.00 - ₹30,000.00 per month\nExpected hours: 4 – 5 per week\nBenefits:\nWork from home\nSchedule:\nDay shift\nMorning shift\nNight shift\nRotational shift\nSupplemental Pay:\nPerformance bonus\nYearly bonus\nWork Location: Remote"
  ]
}